// Функція перевірки, чи є число простим
fn is_prime(n: &u32) -> bool {
    // Числа менші або рівні 1 не є простими
    if *n <= 1 {
        return false;
    }

    // Перевіряємо ділення на всі числа до кореня з n
    for i in 2..=(((*n) as f64).sqrt() as u32) {
        // Якщо число ділиться на i, то воно не просте
        if n % i == 0 {
            return false;
        }
    }

    // Якщо ділення на жодне число не дало результату, то число просте
    true
}

#[test]
fn test_is_prime() {
    // Тестові дані для перевірки
    let test_data = [
        (0, false),      // 0 не є простим
        (1, false),      // 1 не є простим
        (2, true),       // 2 просте
        (3, true),       // 3 просте
        (4, false),      // 4 не є простим
        (5, true),       // 5 просте
        (100, false),    // 100 не є простим
        (10007, true),   // 10007 просте
    ];

    // Перевірка кожного тесту
    test_data
        .iter()
        .for_each(|(n, prime)| assert_eq!(is_prime(n), *prime));
}
